artillery/result_log.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 22:56:40(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 22:56:41(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 22:56:43(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 246/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 61
  median: ...................................................................... 23.8
  p95: ......................................................................... 40
  p99: ......................................................................... 58.6
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 494
  max: ......................................................................... 1403.5
  median: ...................................................................... 1274.3
  p95: ......................................................................... 1408.4
  p99: ......................................................................... 1408.4