artillery/result_sin_log.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 22:59:34(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 22:59:35(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 22:59:38(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 488/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 86
  max: ......................................................................... 149.3
  median: ...................................................................... 113.3
  p95: ......................................................................... 149.9
  p99: ......................................................................... 149.9